---
kind: method
id: M:Autodesk.Revit.UI.ContextualHelp.#ctor(Autodesk.Revit.UI.ContextualHelpType,System.String)
source: html/0ce40fbd-b6f7-45b6-c637-403dd3d073b4.htm
---
# Autodesk.Revit.UI.ContextualHelp.#ctor Method

Constructs a contextual help object.

## Syntax (C#)
```csharp
public ContextualHelp(
	ContextualHelpType helpType,
	string helpPath
)
```

## Parameters
- **helpType** (`Autodesk.Revit.UI.ContextualHelpType`) - The contextual help type.
- **helpPath** (`System.String`) - The contextual help path.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the helpPath is null or empty.